jQuery(function ($) {
  /* --------------------------------------------
  /* 共通機能（全ページで使用）
  /* -------------------------------------------- */

  /* --------------------------------------------
  /* ハンバーガーメニュー(topページ)
  /* -------------------------------------------- */
  $(function () {
    // ハンバーガーメニューのクリック
    $('.js-hamburger').on('click', function () {
      $(this).toggleClass('is-active');             // ハンバーガー自身に is-active
      $('.js-header-nav').toggleClass('is-active'); // ナビを開閉
      $('.js-header').toggleClass('is-active');     // ヘッダー全体
      $('body').toggleClass('is-fixed');            // 背景スクロール制御

      // ロゴ差し替え（SP・PC共通）
      const $logoImg = $('.header__logo img');
      if ($('.js-header').hasClass('is-active')) {
        $logoImg.attr('src', './assets/images/common/tetote-logo.svg'); // 黒ロゴ
      } else {
        $logoImg.attr('src', './assets/images/common/tetote-logo-white.svg'); // 白ロゴ
      }
    });

    // ナビ内のリンクをクリックしたら閉じる
    $('.js-header-link').on('click', function () {
      $('.js-hamburger').removeClass('is-active');
      $('.js-header-nav').removeClass('is-active');
      $('.js-header').removeClass('is-active');
      $('body').removeClass('is-fixed');

      // ロゴを白に戻す（SP・PC共通）
      $('.header__logo img').attr('src', './assets/images/common/tetote-logo-white.svg');
    });
  });

  /* --------------------------------------------
  /* headerをFVの下までスクロールした時に、page-headerと同じデザインに変える
  /* -------------------------------------------- */



  /* --------------------------------------------
  /* index.html(topページ)専用機能
  /* -------------------------------------------- */

  /* --------------------------------------------
  /* index.html(topページ)
  //各セクションの要素をふわっと表示させる（topページ）
  //スクロールしてセクションまで来たら、ふわっと表示
  /* -------------------------------------------- */



  /* --------------------------------------------
  /* index.html(topページ)
  // js-top-fv-swiper (topページFVのスワイパー)
  //2枚の画像をふわっと表示で切り替える
  /* -------------------------------------------- */


  
  /* --------------------------------------------
  /* index.html(topページ)
  // js-top-message-swiper (topページのメッセージスワイパー)
  //自動で止まらずに延々と横スライドし続けるスライダーにする
  /* -------------------------------------------- */



  /* --------------------------------------------
  /* index.html(topページ)
  // js-top-member-swiper (topページのスタッフカードのスワイパー)
  //WordPressのACFから入力したカードがランダムで表示される
  /* -------------------------------------------- */



  /* --------------------------------------------
  /* staff-details.html(スタッフ紹介のページ）専用機能
  /* -------------------------------------------- */

  /* --------------------------------------------
  /* staff-details.html(スタッフ紹介のページ）
  //セクションをスクロールした時に、該当する記事まできたら、
  // sidebarの該当目次の色を$blackに変える(is-activeのつけはずし)
  // (interview-slider-bar__list)
  /* -------------------------------------------- */



  /* --------------------------------------------
  /* staff-details.html(スタッフ紹介のページ)
  // other-members__listは、ランダム表示
  /* -------------------------------------------- */



  /* --------------------------------------------
  /* details.html, faq.html (募集要項とFAQページ)専用機能
  /* -------------------------------------------- */

  /* --------------------------------------------
  /* details.html, faq.html (募集要項とFAQページ)
  // category-tag__itemをクリックしたら、該当のセクションまでスクロールする
  /* -------------------------------------------- */


  
  /* --------------------------------------------
  /* entry.html (エントリーページ）専用機能
  /* -------------------------------------------- */

  /* --------------------------------------------
  /* entry.html (エントリーページ）
  // フォームのバリデーション
  //入力がない場合送信ボタンを押せない様にする
  /* -------------------------------------------- */
});